diplom-src/src/Documents/ВКМ_ГрафикОтпусков/ВКМ_ГрафикОтпусков.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ВКМ_ГрафикОтпусков</name>
  <registerRecords>InformationRegister.ВКМ_ГрафикОтпусков</registerRecords>
  <attributes>
    <name>Год</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Отпуска</name>
    <attributes>
      <name>Сотрудник</name>
      <type>
        <types>CatalogRef.ВКМ_ФизическиеЛица</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаНачала</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаОкончания</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДнейОтпуска</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

diplom-src/src/Documents/ВКМ_ГрафикОтпусков/Forms/ФормаДокумента/Module.bsl
#Область ОбработчикиСобытийЭлементовТаблицыФормыОтпуска
&НаКлиенте
Процедура ОтпускаДатаНачалаПриИзменении(Элемент)
	ТекДанные = Элементы.Отпуска.ТекущиеДанные;
	РасчитатьДнейОтпуска(ТекДанные);
	
КонецПроцедуры

&НаКлиенте
Процедура ОтпускаДатаОкончанияПриИзменении(Элемент)
	ТекДанные = Элементы.Отпуска.ТекущиеДанные;
	РасчитатьДнейОтпуска(ТекДанные);
КонецПроцедуры
#КонецОбласти


#Область ОбработчикиКомандФормы
&НаКлиенте
Процедура ГрафикОтпусков(Команда)
	
	Адрес = СформироватьТаблицуЗначений();
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Адрес", Адрес);
	ПараметрыФормы.Вставить("Период",Объект.Год);
	ОткрытьФорму("Документ.ВКМ_ГрафикОтпусков.Форма.АнализГрафика",ПараметрыФормы ,ЭтотОбъект ,
	УникальныйИдентификатор ,Окно, , , РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры
    
#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура РасчитатьДнейОтпуска(ТекДанные)
	ТекДанные.ДнейОтпуска = (ТекДанные.ДатаОкончания - ТекДанные.ДатаНачала)/86400;
КонецПроцедуры

&НаСервере
Функция СформироватьТаблицуЗначений()

ТаблицаЗначений = Объект.Отпуска.Выгрузить();
Адрес = ПоместитьВоВременноеХранилище(ТаблицаЗначений, УникальныйИдентификатор);
Возврат Адрес

КонецФункции


#КонецОбласти
